---
kind: other
id: Methods.T:Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs
source: html/e049fec6-89f3-f899-6be7-11d76c7aca77.htm
---
# FabricationPartBrowserChangedEventArgs Methods

Returns the total fabrication part type usage count in all routing solutions.